Szkielet aplikacji + logowanie
